Revit 2027 API
ExporterIFC.RegisterFaceWithElementHandle Method
 Register face with element handle to make sure the openings created are related to the right element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RegisterFaceWithElementHandle(
	Face face,
	IFCAnyHandle elemHandle
)
Public Sub RegisterFaceWithElementHandle (
	face As Face,
	elemHandle As IFCAnyHandle
)
public:
void RegisterFaceWithElementHandle(
	Face^ face,
	IFCAnyHandle^ elemHandle
)
member RegisterFaceWithElementHandle :
        face : Face *
        elemHandle : IFCAnyHandle -> unit
Parameters
face Face
 The face.
elemHandle IFCAnyHandle
 The element handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace